docs/ubuntu/software/zssh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-15 三 10:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>zssh</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">zssh</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org346065e">1. 概述</a></li>
<li><a href="#orga056ee3">2. 安装</a></li>
<li><a href="#org2afbaba">3. 使用</a></li>
<li><a href="#orge80cb4f">4. 提示</a></li>
</ul>
</div>
</div>

<div id="outline-container-org346065e" class="outline-2">
<h2 id="org346065e"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://zssh.sourceforge.net/">zssh</a> （Zmodem SSH）是一个程序，用于在使用 ssh 时以交互方式将文件传输到远程计算机。它旨在方便的替代 scp 传输文件，而无需打开另一个会话并重新验证自己。
</p>

<p>
zssh 是 ssh 的交互式包装器，用于切换远程 shell 和文件传输之间的 ssh 连接。这是通过在用户和本地 ssh 进程之间使用另一个 tty/pty 对来实现：在 ssh 连接上插入用户的 tty（远程 shell 模式）或另一个进程（文件传输模式）。
</p>

<p>
ztelnet 的行为类似于 zssh，除了使用 telnet 而不是 ssh。它相当于'zssh -s"telnet -8 -E"'。
</p>

<p>
rz 和 sz 命令通过 zmodem 协议传输文件。
</p>
</div>
</div>

<div id="outline-container-orga056ee3" class="outline-2">
<h2 id="orga056ee3"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">sudo apt install zssh
</pre>
</div>
</div>
</div>

<div id="outline-container-org2afbaba" class="outline-2">
<h2 id="org2afbaba"><span class="section-number-2">3</span> 使用</h2>
<div class="outline-text-2" id="text-3">
<p>
zssh 表现为通常的 ssh 会话，当按下转义序列（当前为 ^ @），这将启用文件传输模式。然后出现一个新提示，并且可以在本地执行命令以启动文件传输（以及其他内容）。它大致表现类似本地 shell，包括行版本，历史记录和完成（感谢 libreadline），globbing 和转义字符（“'和 \”）。
</p>

<p>
以下内置函数由 zssh 本身处理：
</p>
<table border="1" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">命令</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cd [dir]</td>
<td class="org-left">change current directory</td>
</tr>

<tr>
<td class="org-left">disconnect</td>
<td class="org-left">disconnect and exit.</td>
</tr>

<tr>
<td class="org-left">escape [^X]</td>
<td class="org-left">Change escape key to ^X.Without argument, print current escape key</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">exit file transfer mode. ^D may also be used for this purpose.</td>
</tr>

<tr>
<td class="org-left">quit</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">help</td>
<td class="org-left">print help and tips</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">hook prg [args]</td>
<td class="org-left">Hook program 'prg' on the the pty. Its standard input and output will go through the ssh channel. typing 'sz'<i>'rz' is in fact equivalent to 'hook sz'</i>'hook rz'.A weird imagination is most useful to gain full advantage of this feature.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">repeat</td>
<td class="org-left">repeats  cmd  forever  (^C to interrupt). Useful for example if you use a remote script  invoking "sz"  and  you don't want to be typing"rz" each time&#x2026; Remember however that several files can be transferred by a single sz/rz pair so this is not usually necessary to use repeat.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">rz</td>
<td class="org-left">Receive files from the remote machine.  runs  rz and  plugs  the  process  on the ssh connection. running sz on the REMOTE machine is required :</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">+ run `sz &lt;remote_file&gt; &#x2026;' from the  remote machine shell</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">+ press  the  escape  sequence  (^@) to enter file transfer mode</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">+ run the `rz' builtin</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">suspend</td>
<td class="org-left">suspend zssh (back to the local machine shell)</td>
</tr>

<tr>
<td class="org-left">sz &lt;file&gt; &#x2026;</td>
<td class="org-left">Send  files  to  the remote machine. runs sz and plugs the process on the ssh connection. There is  no  need  to  manually  run rz on the remote side.</td>
</tr>

<tr>
<td class="org-left">version</td>
<td class="org-left">print version information</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
rz，sz，hook 和 exit 在完成后返回 shell 模式。
</p>
</div>
</div>

<div id="outline-container-orge80cb4f" class="outline-2">
<h2 id="orge80cb4f"><span class="section-number-2">4</span> 提示</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><p>
如果启动了文件传输但从未完成
</p>

<p>
如果看到如下显示，但是传输一直没有完成：
</p>
<pre class="example">
Bytes Sent:  38144/4610624   BPS:3424     ETA 22:15
or
Bytes Sent:      0/    513   BPS:0        ETA 00:00  Retry 0: Got ZCAN


</pre>
<p>
有可能其中一个系统的 pty/tty 不是 8-bit clean（Linux 是，NetBSD 不是）。
</p>

<p>
使用 rz 的 <code>-e</code> 选项（转义）应该可以解决这个问题。
</p></li>

<li>传输可以用 <code>^C</code> 中断。</li>
<li>如果你卡在 <code>rz/sz</code> 中（例如刚刚运行了 rz，但是又决定不传输任何东西），就打了十几个 <code>^X</code> 来阻止它。</li>
<li>使用 <code>sz -y &lt;files&gt;</code> 覆盖另一侧的文件。</li>
<li>man sz！</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-07-15 三 10:27</p>
<p class="validation"></p>
</div>
</body>
</html>
